"""
Реализуйте функцию choose_plural(), которая принимает два аргумента в следующем порядке:
amount — натуральное число, количество
declensions — кортеж из трех вариантов склонения существительного
Функция должна возвращать строку, полученную путем объединения подходящего существительного 
из кортежа declensions и количества amount, в следующем формате:
<количество> <существительное>
"""


def choose_plural(num, *args):
    return


# примеры:
print(choose_plural(21, ("пример", "примера", "примеров")))
'''
print(choose_plural(92, ("гвоздь", "гвоздя", "гвоздей")))
print(choose_plural(8, ("яблоко", "яблока", "яблок")))
print(choose_plural(111223, ("копейка", "копейки", "копеек")))
print(choose_plural(763434, ("рубль", "рубля", "рублей")))
print(choose_plural(512312, ("цент", "цента", "центов")))
print(choose_plural(59, ("помидор", "помидора", "помидоров")))
print(choose_plural(23424157, ("огурец", "огурца", "огурцов")))
print(choose_plural(240, ("курица", "курицы", "куриц")))
print(choose_plural(49324, ("плюмбус", "плюмбуса", "плюмбусов")))
print(choose_plural(505, ("утка", "утки", "уток")))
print(choose_plural(666, ("шкаф", "шкафа", "шкафов")))
print(choose_plural(11, ("стул", "стула", "стульев")))
print(choose_plural(3458438435812, ("доллар", "доллара", "долларов")))
'''