"""
Реализуйте функцию choose_plural(), которая принимает два аргумента в следующем порядке:
amount — натуральное число, количество
declensions — кортеж из трех вариантов склонения существительного
Функция должна возвращать строку, полученную путем объединения подходящего существительного 
из кортежа declensions и количества amount, в следующем формате:
<количество> <существительное>
"""


def choose_plural(num, *args):
    data = {0: 2, 1: 0, 2: 1, 3: 1, 4: 1, 5: 2, 6: 2, 7: 2, 8: 2, 9: 2, 10: 2,
            11: 2, 12: 2, 13: 2, 14: 2, 15: 2, 16: 2, 17: 2, 18: 2, 19: 2, 20: 2
    }
    n = num
    str_n = str(num)
    if len(str_n) > 2:
        n = int(str_n[-2:])
    if n not in data:
        n = int(str_n[-1])
    return f"{num} {args[0][data[n]]}"


# примеры:
print(choose_plural(21, ("пример", "примера", "примеров")))
print(choose_plural(92, ("гвоздь", "гвоздя", "гвоздей")))
print(choose_plural(8, ("яблоко", "яблока", "яблок")))
print(choose_plural(111223, ("копейка", "копейки", "копеек")))
print(choose_plural(763434, ("рубль", "рубля", "рублей")))
print(choose_plural(512312, ("цент", "цента", "центов")))
print(choose_plural(59, ("помидор", "помидора", "помидоров")))
print(choose_plural(23424157, ("огурец", "огурца", "огурцов")))
print(choose_plural(240, ("курица", "курицы", "куриц")))
print(choose_plural(49324, ("плюмбус", "плюмбуса", "плюмбусов")))
print(choose_plural(505, ("утка", "утки", "уток")))
print(choose_plural(666, ("шкаф", "шкафа", "шкафов")))
print(choose_plural(11, ("стул", "стула", "стульев")))
print(choose_plural(3458438435812, ("доллар", "доллара", "долларов")))
