"""
Функция get_biggest() 🌶️🌶️

Реализуйте функцию get_biggest(), которая принимает один аргумент:
numbers — список целых неотрицательных чисел
Функция должна возвращать наибольшее число, которое можно составить из чисел из списка numbers. 
Если список numbers пуст, функция должна вернуть число -1.
"""
def get_biggest(numbers):
    pass


# Примеры:
print(get_biggest([1, 2, 3]))  # 321
print(get_biggest([61, 228, 9, 3, 11]))  # 961322811
print(get_biggest([7, 71, 72]))  # 77271
print(get_biggest([]))  # -1
