"""
Сотрудники организации 🙂

Дан список сотрудников организации, в котором указаны их фамилии, имена и даты рождения. 
Напишите программу, которая определяет, в какую из дат родилось больше всего сотрудников.

Формат входных данных
На вход программе в первой строке подается натуральное число n — количество сотрудников, 
работающих в организации. В последующих n строках вводятся данные о каждом сотруднике: 
имя, фамилия и дата рождения, разделённые пробелом. Дата рождения указывается в формате DD.MM.YYYY.

Формат выходных данных
Программа должна вывести дату, в которую наибольшее количество сотрудников отмечает день рождения, в формате DD.MM.YYYY. 
Если таких дат несколько, программа должна вывести их все в порядке возрастания, каждую на отдельной строке, в том же формате.
"""

from datetime import datetime

n = int(input())
pattern = "%d.%m.%Y"
data = {}
for _ in range(n):
    *_, birthday = input().split()
    birthday = datetime.strptime(birthday, pattern)
    if birthday in data:
        data[birthday] += 1
    else:
        data[birthday] = 1
max_days = max(data.values())
spis_days = [key for key, value in data.items() if value == max_days]
for day in sorted(spis_days):
    print(datetime.strftime(day, pattern))
