"""
Функция get_all_mondays()

Реализуйте функцию get_all_mondays(), которая принимает один аргумент:

year — натуральное число
Функция должна возвращать отсортированный по возрастанию список всех дат (тип date) года year, выпадающих на понедельник.
"""

import calendar
from datetime import timedelta, date


def get_all_mondays(year):
    return


print(get_all_mondays(2021))
